import re

# Функція для перевірки введеного тексту
def get_valid_input():
    while True:
        text = input("Введіть текст. Зверніть увагу, що в результаті ви отримаєте всі числівники окремо, у формі простих або складених: ").lower().strip()  # Перетворюємо текст на нижній регістр та обрізаємо пробіли
        if text:  # Якщо текст не порожній
            return text
        else:
            print("Будь ласка, введіть текст (не порожній).")

# Запитуємо користувача про введення тексту
text = get_valid_input()

# Шаблони для перевірки на корені числівників (з врахуванням відмінків)
patterns = [
    r'\b\w*багат\w*|\w*мало|\w*мале\w*\b',
    r'\b\w*багац\w*\b',
    r'\bобо\w*\b',
    r'\b\w*кільк\w*\b',
    r'\bпівтор\w*\b',
    r'\b\d+\b',
    r'\b\w*льйон\w*\b',
    r'\bтисяч\w+\b',
    r'\bнул\w+\b',
    r'\b(сто\w*|ста\w*)\b',
    r'\b(одн\w*|один\w*|один)\b',
    r'\b\w*дв\w+\b',
    r'\b(три|три\w+|трьох\w*|трьом\w*|тре\w+|трі\w+|тро\w+)\b',
    r'\bчотир\w+\b',
    r"п[’'']ят\w*\b",
    r'\b(шіст\w+|шест\w+)\b',
    r'\b(сім\w+|сем\w+)\b',
    r'\b(вісім\w*|восьм\w+|вісьм\w+)\b',
    r'\bдев’ят\w+\b',
    r'\bдев’ян\w+\b',
    r'\bдесят\w+\b',
    r'\w+дцят\w+\b',
    r'\b(сорок|сорок\w+)\b',
    r'\b(\w*перш\w+|\w*друг\w+|\w*четвер\w+|\w*шост\w+|\w*сьом\w+|\w*восьм\w+|\w*девʼят\w+|\w*девʼян\w+|\w*сот\w+|\w*тисяч\w+)\b'
]

# Функція для пошуку числівників
def find_numerals(text):
    numerals_found = set()  # Використовуємо set для унікальних значень
    for pattern in patterns:
        # Шукаємо відповідності кожному шаблону
        matches = re.findall(pattern, text)
        numerals_found.update(matches)  # Додаємо знайдені числа у множину

    # Очищаємо результат від зайвої пунктуації, якщо вона є
    numerals_found = [word.strip(",.") for word in numerals_found]
    
    return list(numerals_found)

# Знаходимо всі числівники в тексті
numerals = find_numerals(text)

# Перевірка на наявність числівників
if numerals:
    print("Знайдені числівники:", numerals)
else:
    print("Числівників не знайдено.")